## Running SQL query in Jupyter notebook using %sql (or %%sql) magic  
(requires ipython-sql)

In [1]:
%load_ext sql

### Connect to database rating.db, using SQLAlchemy connect strings

In [3]:
%sql sqlite:///rating.db

u'Connected: None@rating.db'

In [11]:
%sql select * from sqlite_master

Done.

[(u'table', u'Movie', u'Movie', 2, u'CREATE TABLE Movie(mID int, title text, year int, director text)'),
 (u'table', u'Reviewer', u'Reviewer', 3, u'CREATE TABLE Reviewer(rID int, name text)'),
 (u'table', u'Rating', u'Rating', 4, u'CREATE TABLE Rating(rID int, mID int, stars int, ratingDate date)')]

### Check table header

In [23]:
%sql select * from Movie LIMIT 1

Done.

[(101, u'Gone with the Wind', 1939, u'Victor Fleming')]

In [24]:
%sql select * from Rating LIMIT 1

Done.

[(201, 101, 2, u'2011-01-22')]

In [25]:
%sql select * from Reviewer LIMIT 1

Done.

[(201, u'Sarah Martinez')]

### Movie rating queries

Find the titles of all movies directed by Steven Spielberg.

In [12]:
%sql select title from Movie where director = "Steven Spielberg"

Done.

[(u'E.T.',), (u'Raiders of the Lost Ark',)]

Find all years that have a movie that received a rating of 4 or 5, and sort them in increasing order.

In [13]:
%sql select distinct year from Movie m, Rating r where m.mID = r.mID AND (r.stars = 5 or r.stars = 4) order by year

Done.

[(1937,), (1939,), (1981,), (2009,)]

Find the titles of all movies that have no ratings.

In [21]:
%sql select title from Movie where mID IN (select mID from Movie except select mID from Rating)

Done.

[(u'Star Wars',), (u'Titanic',)]

Some reviewers didn't provide a date with their rating. Find the names of all reviewers who have ratings with a NULL value for the date.

In [27]:
%sql select name from Reviewer v, Rating r where v.rID = r.rID and r.ratingDate IS NULL

Done.

[(u'Daniel Lewis',), (u'Chris Jackson',)]

Write a query to return the ratings data in a more readable format: reviewer name, movie title, stars, and ratingDate. Also, sort the data, first by reviewer name, then by movie title, and lastly by number of stars.

In [36]:
%%sql 
select v.name, m.title, r.stars, r.ratingDate from Movie m, Rating r, Reviewer v 
where m.mID = r.mID and r.rID = v.rID
order by v.name, m.title, r.stars

Done.

[(u'Ashley White', u'E.T.', 3, u'2011-01-02'),
 (u'Brittany Harris', u'Raiders of the Lost Ark', 2, u'2011-01-30'),
 (u'Brittany Harris', u'Raiders of the Lost Ark', 4, u'2011-01-12'),
 (u'Brittany Harris', u'The Sound of Music', 2, u'2011-01-20'),
 (u'Chris Jackson', u'E.T.', 2, u'2011-01-22'),
 (u'Chris Jackson', u'Raiders of the Lost Ark', 4, None),
 (u'Chris Jackson', u'The Sound of Music', 3, u'2011-01-27'),
 (u'Daniel Lewis', u'Snow White', 4, None),
 (u'Elizabeth Thomas', u'Avatar', 3, u'2011-01-15'),
 (u'Elizabeth Thomas', u'Snow White', 5, u'2011-01-19'),
 (u'James Cameron', u'Avatar', 5, u'2011-01-20'),
 (u'Mike Anderson', u'Gone with the Wind', 3, u'2011-01-09'),
 (u'Sarah Martinez', u'Gone with the Wind', 2, u'2011-01-22'),
 (u'Sarah Martinez', u'Gone with the Wind', 4, u'2011-01-27')]

For all cases where the same reviewer rated the same movie twice and gave it a higher rating the second time, return the reviewer's name and the title of the movie.

In [40]:
%%sql
select A1.name, A1.title from
(select name, title, ratingDate, stars from Reviewer natural join Rating natural join Movie) A1,
(select name, title, ratingDate, stars from Reviewer natural join Rating natural join Movie) A2
where A1.name = A2.name and A1.title = A2.title and A1.ratingDate < A2.ratingDate and A1.stars < A2.stars
group by A1.name
having count(A1.name) = 1

Done.

[(u'Sarah Martinez', u'Gone with the Wind')]

For each movie that has at least one rating, find the highest number of stars that movie received. Return the movie title and number of stars. Sort by movie title.

In [41]:
%%sql
select title, max(stars) from Reviewer natural join Rating natural join Movie
group by title
order by title

Done.

[(u'Avatar', 5),
 (u'E.T.', 3),
 (u'Gone with the Wind', 4),
 (u'Raiders of the Lost Ark', 4),
 (u'Snow White', 5),
 (u'The Sound of Music', 3)]

For each movie, return the title and the 'rating spread', that is, the difference between highest and lowest ratings given to that movie. Sort by rating spread from highest to lowest, then by movie title.

In [42]:
%%sql
select title, max(stars) - min(stars) as "rating spread" from Reviewer natural join Rating natural join Movie
group by title
order by "rating spread" desc, title

Done.

[(u'Avatar', 2),
 (u'Gone with the Wind', 2),
 (u'Raiders of the Lost Ark', 2),
 (u'E.T.', 1),
 (u'Snow White', 1),
 (u'The Sound of Music', 1)]

Find the difference between the average rating of movies released before 1980 and the average rating of movies released after 1980. (Make sure to calculate the average rating for each movie, then the average of those averages for movies before 1980 and movies after. Don't just calculate the overall average rating before and after 1980.)

In [43]:
%%sql
select abs(avg(A1.a) - avg(A2.a)) as answer from
(select title, year, avg(stars) as a from Reviewer natural join Rating natural join Movie
where year >= 1980
group by title) A1,
(select title, year, avg(stars) as a from Reviewer natural join Rating natural join Movie
where year < 1980
group by title) A2

Done.

[(0.055555555555556246,)]

Find the names of all reviewers who rated Gone with the Wind.

In [51]:
%%sql
select distinct name from Reviewer natural join Rating natural join Movie
where title = "Gone with the Wind"
order by name

Done.

[(u'Mike Anderson',), (u'Sarah Martinez',)]

For any rating where the reviewer is the same as the director of the movie, return the reviewer name, movie title, and number of stars.

In [52]:
%%sql
select name, title, stars from Reviewer natural join Rating natural join Movie
where name = director

Done.

[(u'James Cameron', u'Avatar', 5)]

Return all reviewer names and movie names together in a single list, alphabetized.

In [57]:
%%sql
select name as ans from Reviewer
union
select title as ans from Movie
order by ans

Done.

[(u'Ashley White',),
 (u'Avatar',),
 (u'Brittany Harris',),
 (u'Chris Jackson',),
 (u'Daniel Lewis',),
 (u'E.T.',),
 (u'Elizabeth Thomas',),
 (u'Gone with the Wind',),
 (u'James Cameron',),
 (u'Mike Anderson',),
 (u'Raiders of the Lost Ark',),
 (u'Sarah Martinez',),
 (u'Snow White',),
 (u'Star Wars',),
 (u'The Sound of Music',),
 (u'Titanic',)]

Find the titles of all movies not reviewed by Chris Jackson.

In [58]:
%%sql
select distinct title from Movie
except
select distinct title from Movie natural join Rating natural join Reviewer
where name = 'Chris Jackson'

Done.

[(u'Avatar',),
 (u'Gone with the Wind',),
 (u'Snow White',),
 (u'Star Wars',),
 (u'Titanic',)]

For all pairs of reviewers such that both reviewers gave a rating to the same movie, return the names of both reviewers. Eliminate duplicates, don't pair reviewers with themselves, and include each pair only once. For each pair, return the names in the pair in alphabetical order.

In [61]:
%%sql
select distinct A1.name as name_1, A2.name as name_2 from
(select * from Movie natural join Rating natural join Reviewer) A1, 
(select * from Movie natural join Rating natural join Reviewer) A2
where A1.title = A2.title and A1.name < A2.name
order by name_1

Done.

[(u'Ashley White', u'Chris Jackson'),
 (u'Brittany Harris', u'Chris Jackson'),
 (u'Daniel Lewis', u'Elizabeth Thomas'),
 (u'Elizabeth Thomas', u'James Cameron'),
 (u'Mike Anderson', u'Sarah Martinez')]

For each rating that is the lowest (fewest stars) currently in the database, return the reviewer name, movie title, and number of stars.

In [63]:
%%sql
select name, title, stars from Movie natural join Rating natural join Reviewer
where stars = (select min(stars) from Movie natural join Rating natural join Reviewer)

Done.

[(u'Sarah Martinez', u'Gone with the Wind', 2),
 (u'Brittany Harris', u'The Sound of Music', 2),
 (u'Brittany Harris', u'Raiders of the Lost Ark', 2),
 (u'Chris Jackson', u'E.T.', 2)]

List movie titles and average ratings, from highest-rated to lowest-rated. If two or more movies have the same average rating, list them in alphabetical order.

In [64]:
%%sql 
select title, avg(stars) as a from Movie natural join Rating natural join Reviewer
group by title
order by a desc, title asc

Done.

[(u'Snow White', 4.5),
 (u'Avatar', 4.0),
 (u'Raiders of the Lost Ark', 3.3333333333333335),
 (u'Gone with the Wind', 3.0),
 (u'E.T.', 2.5),
 (u'The Sound of Music', 2.5)]

Find the names of all reviewers who have contributed three or more ratings.

In [65]:
%%sql
select name from Movie natural join Rating natural join Reviewer
group by name
having count(*) >= 3

Done.

[(u'Brittany Harris',), (u'Chris Jackson',)]

Some directors directed more than one movie. For all such directors, return the titles of all movies directed by them, along with the director name. Sort by director name, then movie title.

In [66]:
%%sql
select title, director from Movie
where director in
(select director from Movie
group by director
having count(*) > 1)
order by director, title

Done.

[(u'Avatar', u'James Cameron'),
 (u'Titanic', u'James Cameron'),
 (u'E.T.', u'Steven Spielberg'),
 (u'Raiders of the Lost Ark', u'Steven Spielberg')]

Find the movie(s) with the highest average rating. Return the movie title(s) and average rating.

In [68]:
%%sql
select title, a as avg_rating from
(select title, avg(stars) as a from Movie natural join Reviewer natural join Rating
group by title)
where a = (select max(a) from (select avg(stars) as a from Movie natural join Reviewer natural join Rating
group by title))

Done.

[(u'Snow White', 4.5)]

Find the movie(s) with the lowest average rating. Return the movie title(s) and average rating.

In [70]:
%%sql
select title, a as avg_rating from
(select title, avg(stars) as a from 
Movie natural join Reviewer natural join Rating 
group by title)
where a = (select min(a) from (select title, avg(stars) as a from 
Movie natural join Reviewer natural join Rating
group by title))

Done.

[(u'E.T.', 2.5), (u'The Sound of Music', 2.5)]

For each director, return the director's name together with the title(s) of the movie(s) they directed that received the highest rating among all of their movies, and the value of that rating. Ignore movies whose director is NULL.

In [72]:
%%sql
select director, title, max(a) as highest_rating from
(select title, director, max(stars) as a from Movie natural join Reviewer natural join Rating
where director is not null
group by title)
group by director

Done.

[(u'James Cameron', u'Avatar', 5),
 (u'Robert Wise', u'The Sound of Music', 3),
 (u'Steven Spielberg', u'Raiders of the Lost Ark', 4),
 (u'Victor Fleming', u'Gone with the Wind', 4)]

### Movie rating modifications

Add the reviewer Roger Ebert to your database, with an rID of 209.

In [74]:
%%sql
insert into Reviewer values (209, 'Roger Ebert')

1 rows affected.

[]

In [75]:
%%sql
select * from Reviewer order by rID, name

Done.

[(201, u'Sarah Martinez'),
 (202, u'Daniel Lewis'),
 (203, u'Brittany Harris'),
 (204, u'Mike Anderson'),
 (205, u'Chris Jackson'),
 (206, u'Elizabeth Thomas'),
 (207, u'James Cameron'),
 (208, u'Ashley White'),
 (209, u'Roger Ebert')]

Insert 5-star ratings by James Cameron for all movies in the database. Leave the review date as NULL.

In [76]:
%%sql
insert into Rating
select 207, mID, 5, null
from Movie

8 rows affected.

[]

In [77]:
%%sql
select * from Rating where stars = 5 order by rID, mID

Done.

[(206, 106, 5, u'2011-01-19'),
 (207, 101, 5, None),
 (207, 102, 5, None),
 (207, 103, 5, None),
 (207, 104, 5, None),
 (207, 105, 5, None),
 (207, 106, 5, None),
 (207, 107, 5, u'2011-01-20'),
 (207, 107, 5, None),
 (207, 108, 5, None)]

For all movies that have an average rating of 4 stars or higher, add 25 to the release year.

In [78]:
%%sql
update Movie
set year = year + 25 
where mID in
(select mID from Rating
group by mID
having avg(stars) >= 4)

4 rows affected.

[]

In [79]:
%%sql
select * from Movie order by mID

Done.

[(101, u'Gone with the Wind', 1939, u'Victor Fleming'),
 (102, u'Star Wars', 2002, u'George Lucas'),
 (103, u'The Sound of Music', 1965, u'Robert Wise'),
 (104, u'E.T.', 1982, u'Steven Spielberg'),
 (105, u'Titanic', 2022, u'James Cameron'),
 (106, u'Snow White', 1962, None),
 (107, u'Avatar', 2034, u'James Cameron'),
 (108, u'Raiders of the Lost Ark', 1981, u'Steven Spielberg')]

Remove all ratings where the movie's year is before 1970 or after 2000, and the rating is fewer than 4 stars.

In [80]:
%%sql
delete from Rating
where exists
(select * from
(select * from Rating join Movie using (mID)
where (year < 1970 or year > 2000) and stars < 4) A
where Rating.mID = A.mID and Rating.rID = A.rID and Rating.stars = A.stars and Rating.ratingDate = A.ratingDate)

5 rows affected.

[]

In [81]:
%%sql
select R.rID, R.mID, R.stars, M.title, M.year from Rating R join Movie M on (R.mID = M.mID) order by R.rID, R.mID

Done.

[(201, 101, 4, u'Gone with the Wind', 1939),
 (202, 106, 4, u'Snow White', 1962),
 (203, 108, 4, u'Raiders of the Lost Ark', 1981),
 (203, 108, 2, u'Raiders of the Lost Ark', 1981),
 (205, 104, 2, u'E.T.', 1982),
 (205, 108, 4, u'Raiders of the Lost Ark', 1981),
 (206, 106, 5, u'Snow White', 1962),
 (207, 101, 5, u'Gone with the Wind', 1939),
 (207, 102, 5, u'Star Wars', 2002),
 (207, 103, 5, u'The Sound of Music', 1965),
 (207, 104, 5, u'E.T.', 1982),
 (207, 105, 5, u'Titanic', 2022),
 (207, 106, 5, u'Snow White', 1962),
 (207, 107, 5, u'Avatar', 2034),
 (207, 107, 5, u'Avatar', 2034),
 (207, 108, 5, u'Raiders of the Lost Ark', 1981),
 (208, 104, 3, u'E.T.', 1982)]

### Connect to social.db and do some queries

In [82]:
%sql sqlite:///social.db

u'Connected: None@social.db'

In [83]:
%sql select * from sqlite_master

Done.

[(u'table', u'Highschooler', u'Highschooler', 2, u'CREATE TABLE Highschooler(ID int, name text, grade int)'),
 (u'table', u'Friend', u'Friend', 3, u'CREATE TABLE Friend(ID1 int, ID2 int)'),
 (u'table', u'Likes', u'Likes', 4, u'CREATE TABLE Likes(ID1 int, ID2 int)')]

In [84]:
%sql select * from Highschooler limit 1

Done.

[(1510, u'Jordan', 9)]

In [85]:
%sql select * from Friend limit 1

Done.

[(1510, 1381)]

In [86]:
%sql select * from Likes limit 1

Done.

[(1689, 1709)]

Find the names of all students who are friends with someone named Gabriel.

In [88]:
%%sql
select n as name from
(select ID as i, name as n, grade as g, ID1, ID2 from Highschooler join Friend on ID = ID1) 
join Highschooler on ID2 = Highschooler.ID
where name = 'Gabriel'

Done.

[(u'Jordan',), (u'Cassandra',), (u'Andrew',), (u'Alexis',), (u'Jessica',)]

For every student who likes someone 2 or more grades younger than themselves, return that student's name and grade, and the name and grade of the student they like.

In [97]:
%%sql
select n, g, name, grade from
(select ID as i, name as n, grade as g, ID1, ID2 from Highschooler join Likes on ID = ID1) 
join Highschooler on ID2 = Highschooler.ID
where g - grade >= 2

Done.

[(u'John', 12, u'Haley', 10)]

For every pair of students who both like each other, return the name and grade of both students. Include each pair only once, with the two names in alphabetical order.

In [98]:
%%sql
select * from
(select n, g, name, grade from
(select ID as i, name as n, grade as g, ID1, ID2 from Highschooler join Likes on ID = ID1) join Highschooler on ID2 = Highschooler.ID
intersect
select name, grade, n, g from
(select ID as i, name as n, grade as g, ID1, ID2 from Highschooler join Likes on ID = ID1) join Highschooler on ID2 = Highschooler.ID)
where n < name

Done.

[(u'Cassandra', 9, u'Gabriel', 9), (u'Jessica', 11, u'Kyle', 12)]

Find all students who do not appear in the Likes table (as a student who likes or is liked) and return their names and grades. Sort by grade, then by name within each grade.

In [99]:
%%sql
select name, grade from Highschooler where ID not in
(select ID1 from Likes
union
select ID2 from Likes)
order by grade, name

Done.

[(u'Jordan', 9), (u'Tiffany', 9), (u'Logan', 12)]

For every situation where student A likes student B, but we have no information about whom B likes (that is, B does not appear as an ID1 in the Likes table), return A and B's names and grades.

In [100]:
%%sql
select n, g, name, grade from
(select ID as i, name as n, grade as g, ID1, ID2 from Highschooler join Likes on ID = ID1) join Highschooler on ID2 = Highschooler.ID
where ID2 not in (select ID1 from Likes)

Done.

[(u'Alexis', 11, u'Kris', 10),
 (u'Brittany', 10, u'Kris', 10),
 (u'Austin', 11, u'Jordan', 12),
 (u'John', 12, u'Haley', 10)]

Find names and grades of students who only have friends in the same grade. Return the result sorted by grade, then by name within each grade.

In [101]:
%%sql
select n, g from
(select ID as i, name as n, grade as g, ID1, ID2 from Highschooler join Friend on ID = ID1) join Highschooler on ID2 = Highschooler.ID
group by i
having max(grade) = min(grade)
order by g, n

Done.

[(u'Jordan', 9),
 (u'Brittany', 10),
 (u'Haley', 10),
 (u'Kris', 10),
 (u'Gabriel', 11),
 (u'John', 12),
 (u'Logan', 12)]

For each student A who likes a student B where the two are not friends, find if they have a friend C in common (who can introduce them!). For all such trios, return the name and grade of A, B, and C.

In [102]:
%%sql
select H1.name, H1.grade, H2.name, H2.grade, H3.name, H3.grade 
from Highschooler H1 join Highschooler H2 join Highschooler H3 join
(select A.ID1 as a, A.ID2 as b, F1.ID2 as c 
from (select * from Likes except select * from Friend) A join Friend F1 join Friend F2 
on A.ID1 = F1.ID1 and A.ID2 = F2.ID1
where F1.ID2 = F2.ID2) L 
on H1.ID = L.a and H2.ID = L.b and H3.ID = L.c

Done.

[(u'Austin', 11, u'Jordan', 12, u'Kyle', 12),
 (u'Andrew', 10, u'Cassandra', 9, u'Gabriel', 9),
 (u'Austin', 11, u'Jordan', 12, u'Andrew', 10)]

Find the difference between the number of students in the school and the number of different first names.

In [103]:
%%sql
select c - n from
(select count(ID) as c from Highschooler),
(select count(distinct name) as n from Highschooler)

Done.

[(2,)]

Find the name and grade of all students who are liked by more than one other student.

In [104]:
%%sql
select name, grade from Likes L join Highschooler H on L.ID2 = H.ID
group by ID
having count(*) > 1

Done.

[(u'Kris', 10), (u'Cassandra', 9)]

For every situation where student A likes student B, but student B likes a different student C, return the names and grades of A, B, and C.

In [105]:
%%sql
select H1.name, H1.grade, H2.name, H2.grade, H3.name, H3.grade 
from Highschooler H1 join Likes L1 join Highschooler H2 join Likes L2 join Highschooler H3 
on H1.ID = L1.ID1 and L1.ID2 = H2.ID and H2.ID = L2.ID1 and L2.ID2 = H3.ID
where H3.ID <> H1.ID

Done.

[(u'Andrew', 10, u'Cassandra', 9, u'Gabriel', 9),
 (u'Gabriel', 11, u'Alexis', 11, u'Kris', 10)]

Find those students for whom all of their friends are in different grades from themselves. Return the students' names and grades.

In [106]:
%%sql
select H1.name, H1.grade from Highschooler H1 join Friend F join Highschooler H2 
on H1.ID = F.ID1 and F.ID2 = H2.ID
except
select distinct H1.name, H1.grade from Highschooler H1 join Friend F join Highschooler H2 
on H1.ID = F.ID1 and F.ID2 = H2.ID
where H1.grade = H2.grade

Done.

[(u'Austin', 11)]

What is the average number of friends per student?

In [107]:
%%sql
select cast(f as float) / cast(s as float)
from (select count(*) as s from Highschooler),
(select count(*) as f from Friend)

Done.

[(2.5,)]

Find the number of students who are either friends with Cassandra or are friends of friends of Cassandra. Do not count Cassandra, even though technically she is a friend of a friend.

In [108]:
%%sql
select count(*) from
(select F1.ID2 from Highschooler H1 join Friend F1 join Friend F2 join Highschooler H2 
on H1.ID = F1.ID1 and F1.ID2 = F2.ID1 and F2.ID2 = H2.ID
where H1.name = 'Cassandra' and H2.name is not 'Cassandra'
union
select F2.ID2 from Highschooler H1 join Friend F1 join Friend F2 join Highschooler H2 
on H1.ID = F1.ID1 and F1.ID2 = F2.ID1 and F2.ID2 = H2.ID
where H1.name = 'Cassandra' and H2.name is not 'Cassandra')

Done.

[(7,)]

Find the name and grade of the student(s) with the greatest number of friends.

In [109]:
%%sql
select name, grade from Highschooler H join Friend F on H.ID = F.ID1
group by ID
having count(*) =
(select max(c) from
(select count(*) as c from Highschooler H join Friend F on H.ID = F.ID1
group by ID))

Done.

[(u'Alexis', 11), (u'Andrew', 10)]

### social.db modifications

Remove all 12th graders from Highschooler.

In [110]:
%%sql
delete from Highschooler
where grade = 12

4 rows affected.

[]

In [111]:
%%sql
select * from Highschooler order by ID

Done.

[(1101, u'Haley', 10),
 (1247, u'Alexis', 11),
 (1316, u'Austin', 11),
 (1381, u'Tiffany', 9),
 (1468, u'Kris', 10),
 (1501, u'Jessica', 11),
 (1510, u'Jordan', 9),
 (1641, u'Brittany', 10),
 (1689, u'Gabriel', 9),
 (1709, u'Cassandra', 9),
 (1782, u'Andrew', 10),
 (1911, u'Gabriel', 11)]

If two students A and B are friends, and A likes B but not vice-versa, remove the Likes tuple.

In [112]:
%%sql
delete from Likes
where exists
(select * from
	(select * from Likes intersect select * from Friend
	except
	select L1.ID1, L1.ID2 from Likes L1 join Likes L2 on L1.ID2 = L2.ID1 where L1.ID1 = L2.ID2) A
where A.ID1 = Likes.ID1 and A.ID2 = Likes.ID2)

2 rows affected.

[]

In [113]:
%%sql
select H1.name, H1.grade, H2.name, H2.grade 
from Likes L, Highschooler H1, Highschooler H2 
where L.ID1 = H1.ID and L.ID2 = H2.ID 
order by H1.name, H1.grade

Done.

[(u'Alexis', 11, u'Kris', 10),
 (u'Andrew', 10, u'Cassandra', 9),
 (u'Cassandra', 9, u'Gabriel', 9),
 (u'Gabriel', 9, u'Cassandra', 9)]

For all cases where A is friends with B, and B is friends with C, add a new friendship for the pair A and C. Do not add duplicate friendships, friendships that already exist, or friendships with oneself.

In [114]:
%%sql
insert into Friend
select distinct F1.ID1, F2.ID2 from Friend F1 join Friend F2 on F1.ID2 = F2.ID1 where F1.ID1 <> F2.ID2
except
select * from Friend

54 rows affected.

[]

In [115]:
%%sql
select ID, name, grade, (select count(*) from Friend where id1 = H.id) from Highschooler H order by ID

Done.

[(1101, u'Haley', 10, 3),
 (1247, u'Alexis', 11, 7),
 (1316, u'Austin', 11, 6),
 (1381, u'Tiffany', 9, 6),
 (1468, u'Kris', 10, 6),
 (1501, u'Jessica', 11, 7),
 (1510, u'Jordan', 9, 5),
 (1641, u'Brittany', 10, 3),
 (1689, u'Gabriel', 9, 8),
 (1709, u'Cassandra', 9, 7),
 (1782, u'Andrew', 10, 10),
 (1911, u'Gabriel', 11, 5)]